{
    "love_quotes": [
      {
        "id": 1,
        "english": "A true relationship is with someone who accepts your past, supports your present and encourages your future.",
        "chinese": "真正愛你的人，會接受你的過去、支持你的現在，還會鼓勵你去擁有美好的未來。"
      },
      {
        "id": 2,
        "english": "Anyone can make you smile. Many people can make you cry. But it takes someone really special to make you smile with tears in your eyes.",
        "chinese": "誰都能讓你笑，也有很多人能讓你哭，但只有那個特別的人，能讓你在眼中含淚的時候，依然能笑得出來。"
      },
      {
        "id": 3,
        "english": "Happiness is a drug. And I want to be your dealer.",
        "chinese": "快樂是一種毒品，而我想當你的毒販。"
      },
      {
        "id": 4,
        "english": "I can't promise to fix all your problems, but I can promise you won't have to face them all alone.",
        "chinese": "我無法承諾幫你解決所有的問題，但我保證不會讓你獨自去面對。"
      },
      {
        "id": 5,
        "english": "I don't need someone who is perfect. I need someone who loves me, respects me, cares for me and understands me.",
        "chinese": "我不需要一個完美的對象，我只需要一個疼愛我、尊重我、照顧我和理解我的人。"
      },
      {
        "id": 6,
        "english": "I love you for all that you are, all that you have been, and all you're yet to be.",
        "chinese": "我愛你的全部，包含當下、曾經以及未來的你。"
      },
      {
        "id": 7,
        "english": "I love you not because of who you are, but because of who I am when I am with you.",
        "chinese": "我愛你，不是因為你是一個怎樣的人，而是因為與你在一起時，我變成了怎樣的自己。"
      },
      {
        "id": 8,
        "english": "I love you not for who you are, but for who I am with you.",
        "chinese": "我愛你不是因為你是誰，而是我在你面前可以是誰。"
      },
      {
        "id": 9,
        "english": "If I could give you one thing in life, I would give you the ability to see yourself through my eyes, only then would you realize how special you are to me.",
        "chinese": "如果我能夠在此生中給你一樣東西，我想要給你一種能力，讓你能透過我的雙眼看見你自己，唯有如此你才能了解你對我來說有多麼地特別。"
      },
      {
        "id": 10,
        "english": "If I could rearrange the alphabet, I'd put Y and I together.",
        "chinese": "如果我能重新排列英文字母，我要把 Y（你）跟 I（我）排在一起。"
      },
      {
        "id": 11,
        "english": "If I know what love is, it is because of you.",
        "chinese": "若我能理解愛情為何物，那就是因為你。"
      },
      {
        "id": 12,
        "english": "If someone truly loves you, they won't tell you love stories, they will make a love story with you.",
        "chinese": "如果一個人真的愛你，他不會和你訴說愛情故事，而是會和你一起創造。"
      },
      {
        "id": 13,
        "english": "It's not about trying to find the perfect relationship; it's just about loving someone imperfect, perfectly.",
        "chinese": "並非要試著去找到最完美的關係，而是要徹底地去愛一個不完美的人。"
      },
      {
        "id": 14,
        "english": "It's not being in love that makes me happy. It is the person that I am in love with that does.",
        "chinese": "讓我幸福的不是戀情本身，而是讓我深陷戀情的人。"
      },
      {
        "id": 15,
        "english": "Love can never be taught for it is to be learned; love can never be bought for it is to be given; love can never be kept for it is to be free; love can never be old for it lives to last a lifetime.",
        "chinese": "愛可以學會，而無法教會；愛能夠給予，而無法買到；愛是自由的，而無法佔有；愛持續一生，而永不凋零。"
      },
      {
        "id": 16,
        "english": "Love creates an 'us' without destroying a 'me'.",
        "chinese": "愛情創造了「我們」，卻不會讓「我」隨之毀滅。"
      },
      {
        "id": 17,
        "english": "Love does not consist of gazing at each other, but in looking outward together in the same direction.",
        "chinese": "愛情並非由凝視彼此建構而成，而是一起看向同一個方向前進。"
      },
      {
        "id": 18,
        "english": "Love is a combination of respect, friendship, understanding, communication and companionship.",
        "chinese": "愛是由尊重、友誼、理解、溝通和陪伴所組合而成的。"
      },
      {
        "id": 19,
        "english": "Love is a magical drug; it cures both the ones who give it and those who receive it.",
        "chinese": "愛是一種神奇的藥，它能療癒愛的給予者與接收者。"
      },
      {
        "id": 20,
        "english": "Love is just a word until you find someone who gives it the definition.",
        "chinese": "愛只會是一個文字，直到你找到那個能賦予它意義的人。"
      },
      {
        "id": 21,
        "english": "Love is not a matter of counting the days. It's making the days count.",
        "chinese": "愛情不是數著日子過去，它能讓每個日子變得有意義。"
      },
      {
        "id": 22,
        "english": "Love is not getting but giving.",
        "chinese": "愛是付出，不是占有。"
      },
      {
        "id": 23,
        "english": "Love is that condition in which the happiness of another person is essential to your own.",
        "chinese": "當另一個人的幸福是你幸福的根本所在，那就是愛。"
      },
      {
        "id": 24,
        "english": "Love is the only word to describe what we've been through together.",
        "chinese": "能夠描述我們一起經歷過的種種，唯有愛這個字。"
      },
      {
        "id": 25,
        "english": "Love isn't about who you envision spending the rest of your life with; it's about who you imagine being unable to live a life without.",
        "chinese": "愛不是想像要和誰共度一生，而是無法想像生命中少了誰。"
      },
      {
        "id": 26,
        "english": "Meeting you was fate, becoming your friend was a choice, but falling in love with you was beyond my control.",
        "chinese": "遇見你是命運的安排，成為朋友是我的選擇，而愛上你是我情不自禁。"
      },
      {
        "id": 27,
        "english": "Missing you is my hobby, caring for you is my job, making you happy is my duty and loving you is my life.",
        "chinese": "想念你是我的興趣，照顧你是我的工作，讓你開心是我的責任，疼愛你則是我的人生。"
      },
      {
        "id": 28,
        "english": "My dream wouldn't be complete without you in it.",
        "chinese": "我的夢想沒有你就不會完整了。"
      },
      {
        "id": 29,
        "english": "No words are necessary between two loving hearts.",
        "chinese": "兩顆相愛的心之間不需要言語。"
      },
      {
        "id": 30,
        "english": "One day, we will never have to say goodbye, only goodnight.",
        "chinese": "終有一天，我們不再是說再見，而是互道晚安。"
      },
      {
        "id": 31,
        "english": "One word frees us of all the weight and pain in life. That word is love.",
        "chinese": "有一個字可以讓我們擺脫生活中所有的重擔和痛苦，那就是愛。"
      },
      {
        "id": 32,
        "english": "Some people search their whole lives to find what I found in you.",
        "chinese": "有些人用盡一生找尋我在你身上找到的答案。"
      },
      {
        "id": 33,
        "english": "Someone who really loves you sees what a mess you can be, how moody you can get, how hard you are to handle, but still wants you in their life.",
        "chinese": "真愛就是即使見識過你的各種亂七八糟、各種情緒化、各種難搞，卻還是想要把你留在他的生命裡。"
      },
      {
        "id": 34,
        "english": "The words \"I love you\" take two seconds to say, two hours to explain and a lifetime to prove.",
        "chinese": "「我愛你」這三個字要花兩秒去說、兩小時去解釋、一輩子去證明。"
      },
      {
        "id": 35,
        "english": "There are only two times that I want to be with you — now and forever.",
        "chinese": "只有兩個時間我會想和你在一起——現在以及永遠。"
      },
      {
        "id": 36,
        "english": "There's a reason why two people stay together, they give each other something nobody else can.",
        "chinese": "兩個人會在一起總是有原因的，他們給了彼此别人給不了的東西。"
      },
      {
        "id": 37,
        "english": "Thinking of you keeps me awake. Dreaming of you keeps me asleep. Being with you keeps me alive.",
        "chinese": "想到你會讓我睡不著，夢見你會讓我睡得熟，和你在一起會讓我生命旺盛。"
      },
      {
        "id": 38,
        "english": "To love without condition, to talk without intention, to give without reason, to care without expectation; that's the spirit of true love.",
        "chinese": "沒有條件地去喜愛、沒有意圖地去交談、沒有原因地去付出、沒有期待地去照顧，這就是真愛的精神。"
      },
      {
        "id": 39,
        "english": "To the world you may be one person, but to one person you are the world.",
        "chinese": "對這個世界而言，你也許只是一個人；但對某個人而言，你卻是全世界。"
      },
      {
        "id": 40,
        "english": "True love is when you value your lover's happiness more than yours, and make their happiness your first priority.",
        "chinese": "當你把愛人的幸福看得比自己的還重要，並當成第一順位，那就是真愛。"
      },
      {
        "id": 41,
        "english": "We fall in love by chance, but we stay in love by choice.",
        "chinese": "墜入情網靠緣份，堅守愛情靠抉擇。"
      },
      {
        "id": 42,
        "english": "When I'm alone I feel like I can do so little. But when we are together our love can accomplish so much.",
        "chinese": "當我一個人時，我感覺能做的很少，但當我們一起時，我們的愛能完成好多。"
      },
      {
        "id": 43,
        "english": "When you feel alone, just look at the spaces between your fingers, and remember that's where my fingers fit perfectly.",
        "chinese": "當你感到孤獨時，就看向你指間的縫隙，記得那就是我手指最合適的位置。"
      },
      {
        "id": 44,
        "english": "When you need someone to listen, I'll be there. When you need a hug, I'll be there. When you need someone to hold your hand, I'll be there. When you need someone to wipe your tears, guess what? I'll be there.",
        "chinese": "當你需要有人傾聽時，我就在這裡；當你需要溫暖的懷抱時，我就在這裡；當你需要有人牽你的手時，我就在這裡。當你需要有人為你擦去傷心的淚水時，你知道嗎？我就在這裡。"
      },
      {
        "id": 45,
        "english": "Wherever you go, whatever you do, I will be right here waiting for you.",
        "chinese": "無論你身在何處，無論你為何忙碌，我都會在此為你守候。"
      },
      {
        "id": 46,
        "english": "With the wonder of your love, the sun above always shines.",
        "chinese": "擁有你美麗的愛情，太陽就永遠明媚。"
      },
      {
        "id": 47,
        "english": "You don't love someone for their looks, or their clothes, or for their fancy car, but because they sing a song only you can hear.",
        "chinese": "你愛上某個人不是因為他的長相、穿著，又或者是他高貴的車，而是因為他唱了一首只有你聽得見的歌。"
      },
      {
        "id": 48,
        "english": "Your love turns the dust of everyday life into sparkles and glitter.",
        "chinese": "你的愛能將日常生活的塵土變得閃耀動人。"
      },
      {
        "id": 49,
        "english": "Your smiling at me is my daily dose of magic.",
        "chinese": "你嫣然的微笑是我每日的魔法劑量。"
      },
      {
        "id": 50,
        "english": "You're the first one I think of when I wake up and last one I think of before I go to sleep.",
        "chinese": "我起床時第一個會想到的人和就寢前最後一個會想到的人，就是你。"
      }
    ]
}